programming/javascript/jquery.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>jQuery</title>
<!-- 2018-04-14 Sat 22:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>





</head>
<body>
<div id="content">
<h1 class="title">jQuery</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Snippet</a></li>
<li><a href="#sec-2">2. Function</a>
<ul>
<li><a href="#sec-2-1">2.1. <code>ajax()</code></a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Settings</a></li>
<li><a href="#sec-2-1-2">2.1.2. <code>accepts</code></a></li>
<li><a href="#sec-2-1-3">2.1.3. <code>async</code></a></li>
<li><a href="#sec-2-1-4">2.1.4. <code>beforeSend</code></a></li>
<li><a href="#sec-2-1-5">2.1.5. <code>cache</code></a></li>
<li><a href="#sec-2-1-6">2.1.6. <code>complete</code></a></li>
<li><a href="#sec-2-1-7">2.1.7. <code>contents</code></a></li>
<li><a href="#sec-2-1-8">2.1.8. <code>contentType</code></a></li>
<li><a href="#sec-2-1-9">2.1.9. <code>context</code></a></li>
<li><a href="#sec-2-1-10">2.1.10. <code>converters</code></a></li>
<li><a href="#sec-2-1-11">2.1.11. <code>crossDomain</code></a></li>
<li><a href="#sec-2-1-12">2.1.12. <code>data</code></a></li>
<li><a href="#sec-2-1-13">2.1.13. <code>dataFilter</code></a></li>
<li><a href="#sec-2-1-14">2.1.14. <code>dataType</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Snippet</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<label class="org-src-name">元素是否可见</label>
<pre class="src src-js">$(<span class="org-string">"#element"</span>).is(<span class="org-string">":visible"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Function</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <code>ajax()</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="http://api.jquery.com/jQuery.ajax/">jQuery.ajax()</a>
</p>

<div class="org-src-container">

<pre class="src src-js">jQuery.ajax( url [, settings ])
</pre>
</div>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Settings</h4>
<div class="outline-text-4" id="text-2-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="#jquery_ajax_accepts"><code>accepts</code></a></td>
<td class="left">PlainObject</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><a href="#jquery_ajax_async"><code>async</code></a></td>
<td class="left">Boolean</td>
<td class="left"><code>true</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>beforeSend</code></td>
<td class="left">Function</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>cache</code></td>
<td class="left">Boolean</td>
<td class="left"><code>true</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>complete</code></td>
<td class="left">Function</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>contents</code></td>
<td class="left">PlainObject</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>contentType</code></td>
<td class="left">Boolean</td>
<td class="left"><code>application/x-www-form-urlencoded; charset=UTF-8</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>context</code></td>
<td class="left">PlainObject</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>converters</code></td>
<td class="left">PlainObject</td>
<td class="left"><code>{"* text": window.String, "text html": true, "text json": jQuery.parseJSON, "text xml": jQuery.parseXML}</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>crossDomain</code></td>
<td class="left">Boolean</td>
<td class="left"><code>false</code> for same-domain requests, <code>true</code> for cross-domain requests</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>data</code></td>
<td class="left">PlainObject</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Array</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>dataFilter</code></td>
<td class="left">Function</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>dataType</code></td>
<td class="left">String</td>
<td class="left">Intelligent guess <code>xml</code> <code>json</code> <code>script</code> <code>html</code></td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-variable-name">id</span>) {
    $.ajax({
        type: <span class="org-string">"POST"</span>,
        url: <span class="org-string">"/index.php"</span>,
        data: {id: id},
        dataType: <span class="org-string">"json"</span>,
        <span class="org-function-name">success</span>: <span class="org-keyword">function</span>(<span class="org-variable-name">response</span>) {
            <span class="org-keyword">if</span> (response.result == <span class="org-string">"error"</span>) {
                <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
            }
        }
    });
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <code>accepts</code></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<a id="jquery_ajax_accepts" name="jquery_ajax_accepts"></a>
</p>

<p>
A set of key/value pairs that map a given <code>dataType</code> to its MIME type, which gets sent in the <code>Accept</code> request header.
</p>

<div class="org-src-container">
<label class="org-src-name">Define a custom type <code>mycustomtype</code> to be sent with the request.</label>
<pre class="src src-js">$.ajax({
  accepts: {
    mycustomtype: <span class="org-string">'application/x-some-custom-type'</span>
  },

  <span class="org-comment-delimiter">// </span><span class="org-comment">Instructions for how to deserialize a `mycustomtype`</span>
  converters: {
    <span class="org-string">'text mycustomtype'</span>: <span class="org-keyword">function</span>(<span class="org-variable-name">result</span>) {
      <span class="org-comment-delimiter">// </span><span class="org-comment">Do Stuff</span>
      <span class="org-keyword">return</span> newresult;
    }
  },

  <span class="org-comment-delimiter">// </span><span class="org-comment">Expect a `mycustomtype` back from server</span>
  dataType: <span class="org-string">'mycustomtype'</span>
});
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> <code>async</code></h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<a id="jquery_ajax_async" name="jquery_ajax_async"></a>
</p>

<p>
Cross-domain requests and <code>dataType: "jsonp"</code> requests do not support synchronous operation.
</p>

<p>
Synchronous requests may temporarily lock the browser, disabling any actions while the request is active.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> <code>beforeSend</code></h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
A pre-request callback function that can be used to modify the jqXHR object before it is sent. The jqXHR and settings objects are passed as arguments.
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="org-keyword">function</span> ( <span class="org-variable-name">jqXHR</span> <span class="org-variable-name">jqXHR</span>, <span class="org-variable-name">PlainObject</span> <span class="org-variable-name">settings</span> )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> <code>cache</code></h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
If set to <code>false</code>, it will force requested pages not to be cached by the browser.
</p>

<p>
Setting to <code>false</code> will only work correctly with HEAD and GET requests. It works by appending <code>_={timestamp}</code> to the GET parameters.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> <code>complete</code></h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
A function to be called when the request finishes, after <code>success</code> and <code>error</code> callbacks are executed.
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="org-keyword">function</span> ( <span class="org-variable-name">jqXHR</span> <span class="org-variable-name">jqXHR</span>, <span class="org-variable-name">String</span> <span class="org-variable-name">textStatus</span> )
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <code>textStatus</code></caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>success</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>error</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>timeout</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>abort</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>notmodified</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>nocontent</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>parsererror</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> <code>contents</code></h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
An object of string/regular-expression pairs that determine how jQuery will parse the response, given its content type.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> <code>contentType</code></h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
When sending data to the server, use this content type.
</p>

<p>
The W3C XMLHttpRequest specification dictates that the charset is always UTF-8; specifying another charset will not force the browser to change the encoding.
</p>

<p>
For cross-domain requests, setting the content type to anything other than <code>application/x-www-form-urlencoded</code> <code>multipart/form-data</code> <code>text/plain</code> will trigger the browser to send a preflight OPTIONS request to the server.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-9" class="outline-4">
<h4 id="sec-2-1-9"><span class="section-number-4">2.1.9</span> <code>context</code></h4>
<div class="outline-text-4" id="text-2-1-9">
<p>
The context of all Ajax-related callbacks.
</p>

<p>
By default, the context is an object that represents the Ajax settings used in the call (<code>$.ajaxSettings</code> merged with the settings passed to <code>$.ajax</code>).
</p>

<div class="org-src-container">
<label class="org-src-name">Specify a DOM element as the context to make that the context for the complete callback of a request.</label>
<pre class="src src-js">$.ajax({
  url: <span class="org-string">"test.html"</span>,
  context: document.body
}).done(<span class="org-keyword">function</span>() {
  $(<span class="org-constant">this</span>).addClass(<span class="org-string">"done"</span>);
});
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-10" class="outline-4">
<h4 id="sec-2-1-10"><span class="section-number-4">2.1.10</span> <code>converters</code></h4>
<div class="outline-text-4" id="text-2-1-10">
<p>
An object containing dataType-to-dataType converters. Each converter's value is a function that returns the transformed value of the response.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-11" class="outline-4">
<h4 id="sec-2-1-11"><span class="section-number-4">2.1.11</span> <code>crossDomain</code></h4>
<div class="outline-text-4" id="text-2-1-11">
<p>
Set to <code>true</code> to force a crossDomain request (such as JSONP) on the same domain. This allows, for example, server-side redirection to another domain.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-12" class="outline-4">
<h4 id="sec-2-1-12"><span class="section-number-4">2.1.12</span> <code>data</code></h4>
<div class="outline-text-4" id="text-2-1-12">
<p>
Data to be sent to the server.
</p>

<p>
It is converted to a query string, if not already a string. It's appended to the url for GET-requests.
</p>

<p>
Object must be Key/Value pairs. If value is an Array, jQuery serializes multiple values with same key based on the value of the <code>traditional</code> setting.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-13" class="outline-4">
<h4 id="sec-2-1-13"><span class="section-number-4">2.1.13</span> <code>dataFilter</code></h4>
<div class="outline-text-4" id="text-2-1-13">
<p>
A function to be used to handle the raw response data of XMLHttpRequest. This is a pre-filtering function to sanitize the response.
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="org-keyword">function</span> (
    String data <span class="org-comment-delimiter">// </span><span class="org-comment">Raw data returned from the server</span>
,   String type <span class="org-comment-delimiter">// </span><span class="org-comment">"dataType" parameter</span>
)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-14" class="outline-4">
<h4 id="sec-2-1-14"><span class="section-number-4">2.1.14</span> <code>dataType</code></h4>
<div class="outline-text-4" id="text-2-1-14">
<p>
The type of data expected back from the server. If none is specified, jQuery will try to infer it based on the MIME type of the response.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Return</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>xml</code></td>
<td class="left">XML document</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>html</code></td>
<td class="left">Plain text</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>script</code></td>
<td class="left">Plain text</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>json</code></td>
<td class="left">JavaScript object</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>jsonp</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<hr  />

<p>
<code>html</code> : Included script tags are evaluated when inserted in the DOM.
</p>

<hr  />

<p>
<code>script</code> : Evaluates the response as JavaScript and returns it as plain text.
</p>

<hr  />

<p>
<code>json</code> : JSON data is parsed in a strict manner. Cross-domain requests are converted to "jsonp" unless the request includes option <code>jsonp: false</code>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-04-14 Sat 22:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
